*문제 : 새 이름 짓기 규칙이 어떻게 되는가?
1.l : \x.(\z.(x z)) z ---> \v.(z v) : ok (새 이름 / 결과 괄호..는 맞음 \v.(z) (v)로 나오네)
1-2.l : 1에서 마지막 z대신 \y.y k  : \z.(k z) ok
2.l : \x.x" "\x.x") ok
3.l : (\x.x) x" "x") ok
4.l : x (\y.y)" "x (\y.y)") ok
5.l : (\x.(\y.y) z) k" "z") ok
s1.l : ((\x.y) ( (\x.(x x)) (\x.(x x)) ) )" "y") 
6.l : (\y.(\x.(y (((\s.(\z.z)) y) x)))) " "\y.(\x.(y x))") : ok (결과괄호 ..?)
7.l : (\x.x(x a)) (\x.x(x a)) -> ((a) ((a) (a))) (((a) ((a) (a))) (a)) : ok
8.l : ((\x.x) z)(y) --> (z) (y) : ok
9.l : (\u0.(\u1.(\u0.(u0 u1 u2)) (u0 x z))) --> \u0.\u1.((((u0) (x)) (z)) (u1)) (u2) : ok 
10.l : (\u0.(\u1.(\u0.(u0 u1 u2)) (u0 x z))) o --> \u1.((((o) (x)) (z)) (u1)) (u2) : ok
11.l : (\u0.(\u1.(\u0.(u0 u1 u2)) (u0 x z))) o u --> ((((o) (x)) (z)) (u)) (u2) : ok
12.l : ((\u0.(\u1.(\u0.(u0 u1 u2)) (u0 x z))) u1) --> \u3.((((u1) (x)) (z)) (u3)) (u2) : ok 새 이름 
13.l : ((\u0.(\u1.(\u0.(u0 u1 u2)) (u0 x z))) u1) u0 --> ((((u1) (x)) (z)) (u0)) (u2) : ok
s2.l : ((\x.x)(\x.z))((\x.x x x)(\x.x x x)) --> z
14.l : ((\x.((\x.(\y.((y x) x))) x)) z) " "(\y.((y z) z))") : ok
15.l : (\y.(\z.((\x.(x y))(\x.x z)))x)(\x.x x) " "x x") : ok

16.l : (   (\y.((\x.x x)  ((\x.x x) ((\x.x x) y))))  (\x.x)    ) z //// "z") : ok
17.l : ((\y.((\x.y x)((\x.y x)((\x.y x)y))))(\x.x)) z " "z") : ok
18.l : (\x.(\y.(((\x.x) (\x.(y x))) (\x.x)))) " "(\x.(\y.(y (\x.x))))") : ok 
19.l : ((\y.(\z.((\x.(x y)) (\x.x z))) x) (\x.(\y.y x))) (\x. x) " "x") : ok
20.l : ((((\x.(\x.(\x.((y (\x.((z x) x))) z)))) x) y) z) " "(((y (\x.((z x) x))) z))") : ok 새 이름
21.l : " (((\x.\y.\z.((z((x y) z))(x y)))(\x.\y.y))(\x.\x.x))(\z.x z) " 
	 ---> "(x (\z.(x z))) (\y.y)" : ok 새 이름
s3.l : (\a.\b.b) ((\x.x x) (\x.x x))" "\b.b"
